Информационная_база/src/Catalogs/МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника/МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗагрузки</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТабличнойЧасти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МаппингПолей</name>
    <attributes>
      <name>НомерКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Информационная_база/src/Catalogs/МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура УстановитьОтборы()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Пользователь",	КэшЗначений.ТекущийПользователь,ВидСравненияКомпоновкиДанных.Равно, НСтр("ru ='Пользователь'"), Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ОбъектЗагрузки",КэшЗначений.ОбъектЗагрузки,		ВидСравненияКомпоновкиДанных.Равно, НСтр("ru ='Объект загрузки'"), Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИмяТабличнойЧасти",КэшЗначений.ИмяТабличнойЧасти,		ВидСравненияКомпоновкиДанных.Равно, НСтр("ru ='Объект загрузки'"), Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ПолныйПутьОбъектЗагрузки;
	
	Если НЕ Параметры.Свойство("ОбъектЗагрузки", ПолныйПутьОбъектЗагрузки) Тогда
		
		ВызватьИсключение НСтр("ru ='Самостоятельное использование формы не предусмотрено.'");
		
	КонецЕсли;
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ВыбранныеПоля",		Неопределено);
	КэшЗначений.Вставить("ТекущийПользователь",	Пользователи.АвторизованныйПользователь());
	КэшЗначений.Вставить("ПолныйПутьОбъектЗагрузки", ПолныйПутьОбъектЗагрузки);
	
	ОписаниеОбъектаЗагрузки = ЗагрузкаДанныхИзВнешнегоИсточника.ОбъектЗагрузкиПоПолномуИмени(ПолныйПутьОбъектЗагрузки);
	КэшЗначений.Вставить("ОбъектЗагрузки",		ОписаниеОбъектаЗагрузки.ОбъектЗагрузки);
	КэшЗначений.Вставить("ИмяТабличнойЧасти",	ОписаниеОбъектаЗагрузки.ИмяТабличнойЧасти);
	
	Параметры.Свойство("ВыбранныеПоля", КэшЗначений.ВыбранныеПоля);
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ВыбранныеПоля",				КэшЗначений.ВыбранныеПоля);
	ДанныеЗаполнения.Вставить("Пользователь",				КэшЗначений.ТекущийПользователь);
	ДанныеЗаполнения.Вставить("ПолныйПутьОбъектЗагрузки",	КэшЗначений.ПолныйПутьОбъектЗагрузки);
	ДанныеЗаполнения.Вставить("ОбъектЗагрузки",				КэшЗначений.ОбъектЗагрузки);
	ДанныеЗаполнения.Вставить("ИмяТабличнойЧасти",			КэшЗначений.ИмяТабличнойЧасти);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	ОткрытьФорму("Справочник.МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры
